<!DOCTYPE html>
<html class="no-js" lang="en">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<title>CSRSS 基础知识 - Logic Security 逻辑门</title>
	<script>(function(d,e){d[e]=d[e].replace("no-js","js");})(document.documentElement,"className");</script>
	<meta name="description" content="csrss基础知识">
		<meta property="og:title" content="CSRSS 基础知识" />
<meta property="og:description" content="csrss基础知识" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://www.zoemurmure.top/posts/csrss_base/" /><meta property="article:section" content="posts" />
<meta property="article:published_time" content="2023-01-10T17:07:41+08:00" />
<meta property="article:modified_time" content="2023-01-10T17:07:41+08:00" />

		<meta itemprop="name" content="CSRSS 基础知识">
<meta itemprop="description" content="csrss基础知识"><meta itemprop="datePublished" content="2023-01-10T17:07:41+08:00" />
<meta itemprop="dateModified" content="2023-01-10T17:07:41+08:00" />
<meta itemprop="wordCount" content="1227">
<meta itemprop="keywords" content="os," />
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link rel="dns-prefetch" href="//fonts.googleapis.com">
	<link rel="dns-prefetch" href="//fonts.gstatic.com">
	<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans:400,400i,700">

	<link rel="stylesheet" href="/css/style.css">

              | BaseGetProcessCrtlRoutine      |                            | CsrGetProcessLuid           |            |         |
              | BaseSetProcessCreateNotify     | SrvEndTask                 | CsrImpersonateClient        |            |         |
              | BaseSrvNlsLogon                | UserCreateCallbackThread   | CsrIsClientSandboxed        |            |         |
Export Func   | BaseSrvNlsUpdateRegistryCache  | UserHardError              | CsrLockProcessByClientId    |            |         |
              | BaseSrvRegisterSxS             | UserServerDllInitialization| CsrLockThreadByClientId     |            |         |
              | ServerDllInitialization        |                            | CsrLockedReferenceProcess   |            |         |
              |                                |                            | CsrQueryApiPort             |            |         |
              |                                |                            | CsrReferenceThread          |            |         |
              |                                |                            | CsrRegisterClientThreadSetup|            |         |
              |                                |                            | CsrReplyToMessage           |            |         |
              |                                |                            | CsrRevertToSelf             |            |         |
              |                                |                            | CsrServerInitialization     |            |         |
              |                                |                            | CsrSetBackgroundPriority    |            |         |
              |                                |                            | CsrSetForegroundPriority    |            |         |
              |                                |                            | CsrShutdownProcesses        |            |         |
              |                                |                            | CsrUnhandledExceptionFilter |            |         |
              |                                |                            | CsrUnlockProcess            |            |         |
              |                                |                            | CsrUnlockThread             |            |         |
              |                                |                            | CsrValidateMessageBuffer    |            |         |
              |                                |                            | CsrValidateMessageString    |            |         |
----------------------------------------------------------------------------------------------------------------------------------
</code></pre><p>Windows Vista 及之后的系统中会存在多个 csrss.exe 进程，其中一个 csrss.exe 进程由 Session Manager(smss.exe) 在系统启动时创建，负责处理来自 session-0 模块的请求，并存在于整个系统生命周期，如果该进程崩溃，则整个系统崩溃；其余 csrss.exe 进程在某用户登录时由 smss.exe 创建，负责处理来自该用户会话下应用程序的请求，并存在于该用户登录期间，进程崩溃不会导致系统崩溃。所有 csrss.exe 进程都具有最高用户权限 NT AUTHORITY\SYSTEM。</p>
<pre tabindex="0"><code>1: kd&gt; dt csrss!_csr_process 
   +0x000 ClientId         : _CLIENT_ID
   +0x010 ListLink         : _LIST_ENTRY
   +0x020 ThreadList       : _LIST_ENTRY
   +0x030 NtSession        : Ptr64 _CSR_NT_SESSION
   +0x038 ClientPort       : Ptr64 Void
   +0x040 ClientViewBase   : Ptr64 Char
   +0x048 ClientViewBounds : Ptr64 Char
   +0x050 ProcessHandle    : Ptr64 Void
   +0x058 SequenceNumber   : Uint4B
   +0x05c Flags            : Uint4B
   +0x060 DebugFlags       : Uint4B
   +0x064 ReferenceCount   : Int4B
   +0x068 ProcessGroupId   : Uint4B
   +0x06c ProcessGroupSequence : Uint4B
   +0x070 LastMessageSequence : Uint4B
   +0x074 NumOutstandingMessages : Uint4B
   +0x078 ShutdownLevel    : Uint4B
   +0x07c ShutdownFlags    : Uint4B
   +0x080 Luid             : _LUID
   +0x088 ServerDllPerProcessData : [1] Ptr64 Void
</code></pre><h2 id="4-side-by-side">4. Side-by-side</h2>
<p>上面的 sxssrv.dll 和 sxs.dll 和 Windows 的 Side-by-side 功能有关，这里学习一下 sxs。</p>
<h3 id="41-基本概念">4.1 基本概念</h3>
<p>在不使用 sxs 功能的一般情况下，一个程序要加载它需要的 DLL 文件，需要按照以下顺序搜索 DLL 文件名：</p>
<ul>
<li>被加载应用程序所在目录</li>
<li>native Windows 系统目录 (<code>C:\Windows\System32</code>)</li>
<li>16-bit Windows 系统目录 (<code>C:\Windows\System</code>)</li>
<li>Windows 目录 (<code>C:\Windows</code>)</li>
<li>应用程序加载时的当前目录</li>
<li><code>%PATH</code> 环境变量中指定目录</li>
</ul>
<p>这种加载方式很容易带来安全问题，为此 Windows 也提供了很多种机制进行防护，这里不再列举。</p>
<p>考虑更复杂的情况，由于 DLL 文件中的功能会出于安全、性能等原因进行修改，DLL 文件的版本会更新，但是开发者开发的程序要求可能比较苛刻，只能使用某版本 DLL 文件中提供的功能，在这种情况下，应用程序需要有一种方式指定使用某版本的 DLL 文件，同时 Windows 也需要以某种机制向该程序提供该版本的 DLL 文件。为此，引入了 side-by-side assembly 这一概念。</p>
