<!DOCTYPE html>
<html class="no-js" lang="en">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<title>CSRSS Basics - Logic Security</title>
	<script>(function(d,e){d[e]=d[e].replace("no-js","js");})(document.documentElement,"className");</script>
	<meta name="description" content="">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link rel="dns-prefetch" href="//fonts.googleapis.com">
	<link rel="dns-prefetch" href="//fonts.gstatic.com">
	<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans:400,400i,700">

	<link rel="stylesheet" href="/css/style.css">
	

	<link rel="shortcut icon" href="/favicon.ico">
		
<script async src="https://www.googletagmanager.com/gtag/js?id=G-CPJWE5ZVG9"></script>
<script>
var doNotTrack = false;
if (!doNotTrack) {
	window.dataLayer = window.dataLayer || [];
	function gtag(){dataLayer.push(arguments);}
	gtag('js', new Date());
	gtag('config', 'G-CPJWE5ZVG9', { 'anonymize_ip': false });
}
</script>

</head>
<body class="body">
	<div class="container container--outer">
		<header class="header">
	<div class="container header__container">
		
	<div class="logo logo--mixed">
		<a class="logo__link" href="/" title="Logic Security" rel="home">
			<div class="logo__item logo__imagebox">
					<img class="logo__img" src="/img/blog_img.png">
				</div><div class="logo__item logo__text">

              | BaseSrvRegisterSxS             | UserServerDllInitialization| CsrLockThreadByClientId     |            |         |
              | ServerDllInitialization        |                            | CsrLockedReferenceProcess   |            |         |
              |                                |                            | CsrQueryApiPort             |            |         |
              |                                |                            | CsrReferenceThread          |            |         |
              |                                |                            | CsrRegisterClientThreadSetup|            |         |
              |                                |                            | CsrReplyToMessage           |            |         |
              |                                |                            | CsrRevertToSelf             |            |         |
              |                                |                            | CsrServerInitialization     |            |         |
              |                                |                            | CsrSetBackgroundPriority    |            |         |
              |                                |                            | CsrSetForegroundPriority    |            |         |
              |                                |                            | CsrShutdownProcesses        |            |         |
              |                                |                            | CsrUnhandledExceptionFilter |            |         |
              |                                |                            | CsrUnlockProcess            |            |         |
              |                                |                            | CsrUnlockThread             |            |         |
              |                                |                            | CsrValidateMessageBuffer    |            |         |
              |                                |                            | CsrValidateMessageString    |            |         |
----------------------------------------------------------------------------------------------------------------------------------
</code></pre><p>In Windows Vista and later systems, multiple <code>csrss.exe</code> processes can exist. One <code>csrss.exe</code> process is created by the Session Manager (<code>smss.exe</code>) during system startup to handle requests from session-0 modules and exists throughout the system lifecycle; if this process crashes, the entire system crashes. The remaining <code>csrss.exe</code> processes are created by <code>smss.exe</code> when a user logs on. They are responsible for handling requests from applications under that user session and exist only during the user&rsquo;s login session; a crash of these processes will not cause the system to crash. All <code>csrss.exe</code> processes run with the highest user privileges: <code>NT AUTHORITY\SYSTEM</code>.</p>
<pre tabindex="0"><code>1: kd&gt; dt csrss!_csr_process 
   +0x000 ClientId         : _CLIENT_ID
   +0x010 ListLink         : _LIST_ENTRY
   +0x020 ThreadList       : _LIST_ENTRY
   +0x030 NtSession        : Ptr64 _CSR_NT_SESSION
   +0x038 ClientPort       : Ptr64 Void
   +0x040 ClientViewBase   : Ptr64 Char
   +0x048 ClientViewBounds : Ptr64 Char
   +0x050 ProcessHandle    : Ptr64 Void
   +0x058 SequenceNumber   : Uint4B
   +0x05c Flags            : Uint4B
   +0x060 DebugFlags       : Uint4B
   +0x064 ReferenceCount   : Int4B
   +0x068 ProcessGroupId   : Uint4B
   +0x06c ProcessGroupSequence : Uint4B
   +0x070 LastMessageSequence : Uint4B
   +0x074 NumOutstandingMessages : Uint4B
   +0x078 ShutdownLevel    : Uint4B
   +0x07c ShutdownFlags    : Uint4B
   +0x080 Luid             : _LUID
   +0x088 ServerDllPerProcessData : [1] Ptr64 Void
</code></pre><h2 id="4-side-by-side">4. Side-by-side</h2>
<p>The <code>sxssrv.dll</code> and <code>sxs.dll</code> mentioned above are related to the Windows Side-by-side (SxS) feature. Let&rsquo;s study SxS here.</p>
<h3 id="41-basic-concepts">4.1 Basic Concepts</h3>
<p>Normally, when not using the SxS feature, an application searches for the DLL files it needs to load in the following order:</p>
<ul>
<li>The directory from which the application loaded.</li>
<li>The native Windows system directory (<code>C:\Windows\System32</code>).</li>
<li>The 16-bit Windows system directory (<code>C:\Windows\System</code>).</li>
<li>The Windows directory (<code>C:\Windows</code>).</li>
<li>The current directory at the time the application loaded.</li>
<li>The directories specified in the <code>%PATH%</code> environment variable.</li>
</ul>
